kayneyao/visionaid/arduino/STM32_MPU9250/STM32_MPU9250.cpp
#include "STM32_MPU9250.h"

STM32_MPU9250::STM32_MPU9250(uint8_t address, TwoWire &wirePort, uint32_t clock_frequency)
{
    _I2Caddr = address;
    _wire = &wirePort;

    _interfaceSpeed = clock_frequency;

    _wire->begin();
    _wire->setClock(_interfaceSpeed);
}

void STM32_MPU9250::getMres()
{
    switch (Mscale)
    {
    // Possible magnetometer scales (and their register bit settings) are:
    // 14 bit resolution (0) and 16 bit resolution (1)
    case MFS_14BITS:
        mRes = 10.0f * 4912.0f / 8190.0f; // Proper scale to return milliGauss
        break;
    case MFS_16BITS:
        mRes = 10.0f * 4912.0f / 32760.0f; // Proper scale to return milliGauss
        break;
    }
}

void STM32_MPU9250::getGres()
{
    switch (Gscale)
    {
    // Possible gyro scales (and their register bit settings) are:
    // 250 DPS (00), 500 DPS (01), 1000 DPS (10), and 2000 DPS (11).
    // Here's a bit of an algorith to calculate DPS/(ADC tick) based on that
    // 2-bit value:
    case GFS_250DPS:
        gRes = 250.0f / 32768.0f;
        break;
    case GFS_500DPS:
        gRes = 500.0f / 32768.0f;
        break;
    case GFS_1000DPS:
        gRes = 1000.0f / 32768.0f;
        break;
    case GFS_2000DPS:
        gRes = 2000.0f / 32768.0f;
        break;
    }
}

void STM32_MPU9250::getAres()
{
    switch (Ascale)
    {
    // Possible accelerometer scales (and their register bit settings) are:
    // 2 Gs (00), 4 Gs (01), 8 Gs (10), and 16 Gs  (11).
    // Here's a bit of an algorith to calculate DPS/(ADC tick) based on that
    // 2-bit value:
    case AFS_2G:
        aRes = 2.0f / 32768.0f;
        break;
    case AFS_4G:
        aRes = 4.0f / 32768.0f;
        break;
    case AFS_8G:
        aRes = 8.0f / 32768.0f;
        break;
    case AFS_16G:
        aRes = 16.0f / 32768.0f;
        break;
    }
}

void STM32_MPU9250::readAccelData(int16_t *destination)
{
    uint8_t rawData[6]; // x/y/z accel register data stored here
    // Read the six raw data registers into data array
    readBytes(_I2Caddr, ACCEL_XOUT_H, 6, &rawData[0]);

    // Turn the MSB and LSB into a signed 16-bit value
    destination[0] = ((int16_t)rawData[0] << 8) | rawData[1];
    destination[1] = ((int16_t)rawData[2] << 8) | rawData[3];
    destination[2] = ((int16_t)rawData[4] << 8) | rawData[5];
}

void STM32_MPU9250::readGyroData(int16_t *destination)
{
    uint8_t rawData[6]; // x/y/z gyro register data stored here
    // Read the six raw data registers sequentially into data array
    readBytes(_I2Caddr, GYRO_XOUT_H, 6, &rawData[0]);

    // Turn the MSB and LSB into a signed 16-bit value
    destination[0] = ((int16_t)rawData[0] << 8) | rawData[1];
    destination[1] = ((int16_t)rawData[2] << 8) | rawData[3];
    destination[2] = ((int16_t)rawData[4] << 8) | rawData[5];
}

void STM32_MPU9250::readMagData(int16_t *destination)
{
    // x/y/z gyro register data, ST2 register stored here, must read ST2 at end
    // of data acquisition
    uint8_t rawData[7];
    // Wait for magnetometer data ready bit to be set
    if (readByte(AK8963_ADDRESS, AK8963_ST1) & 0x01)
    {
        // Read the six raw data and ST2 registers sequentially into data array
        readBytes(AK8963_ADDRESS, AK8963_XOUT_L, 7, &rawData[0]);
        uint8_t c = rawData[6]; // End data read by reading ST2 register
        // Check if magnetic sensor overflow set, if not then report data
        if (!(c & 0x08))
        {
            // Turn the MSB and LSB into a signed 16-bit value
            destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
            // Data stored as little Endian
            destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
            destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
        }
    }
}

int16_t STM32_MPU9250::readTempData()
{
    uint8_t rawData[2]; // x/y/z gyro register data stored here
    // Read the two raw data registers sequentially into data array
    readBytes(_I2Caddr, TEMP_OUT_H, 2, &rawData[0]);
    // Turn the MSB and LSB into a 16-bit value
    return ((int16_t)rawData[0] << 8) | rawData[1];
}

// Calculate the time the last update took for use in the quaternion filters
// TODO: This doesn't really belong in this class.
void STM32_MPU9250::updateTime()
{
    Now = micros();

    // Set integration time by time elapsed since last filter update
    deltat = ((Now - lastUpdate) / 1000000.0f);
    lastUpdate = Now;

    sum += deltat; // sum for averaging filter update rate
    sumCount++;
}

void STM32_MPU9250::initAK8963(float *destination)
{
    // First extract the factory calibration for each magnetometer axis
    uint8_t rawData[3]; // x/y/z gyro calibration data stored here
    // TODO: Test this!! Likely doesn't work
    writeByte(AK8963_ADDRESS, AK8963_CNTL, 0x00); // Power down magnetometer
    delay(10);
    writeByte(AK8963_ADDRESS, AK8963_CNTL, 0x0F); // Enter Fuse ROM access mode
    delay(10);

    // Read the x-, y-, and z-axis calibration values
    readBytes(AK8963_ADDRESS, AK8963_ASAX, 3, &rawData[0]);

    // Return x-axis sensitivity adjustment values, etc.
    destination[0] = (float)(rawData[0] - 128) / 256. + 1.;
    destination[1] = (float)(rawData[1] - 128) / 256. + 1.;
    destination[2] = (float)(rawData[2] - 128) / 256. + 1.;
    writeByte(AK8963_ADDRESS, AK8963_CNTL, 0x00); // Power down magnetometer
    delay(10);

    // Configure the magnetometer for continuous read and highest resolution.
    // Set Mscale bit 4 to 1 (0) to enable 16 (14) bit resolution in CNTL
    // register, and enable continuous mode data acquisition Mmode (bits [3:0]),
    // 0010 for 8 Hz and 0110 for 100 Hz sample rates.

    // Set magnetometer data resolution and sample ODR
    writeByte(AK8963_ADDRESS, AK8963_CNTL, Mscale << 4 | Mmode);
    delay(10);
}

void STM32_MPU9250::initMPU9250()
{
    // wake up device
    // Clear sleep mode bit (6), enable all sensors
    writeByte(_I2Caddr, PWR_MGMT_1, 0x00);
    delay(100); // Wait for all registers to reset

    // Get stable time source
    // Auto select clock source to be PLL gyroscope reference if ready else
    writeByte(_I2Caddr, PWR_MGMT_1, 0x01);
    delay(200);

    // Configure Gyro and Thermometer
    // Disable FSYNC and set thermometer and gyro bandwidth to 41 and 42 Hz,
    // respectively;
    // minimum delay time for this setting is 5.9 ms, which means sensor fusion
    // update rates cannot be higher than 1 / 0.0059 = 170 Hz
    // DLPF_CFG = bits 2:0 = 011; this limits the sample rate to 1000 Hz for both
    // With the MPU9250, it is possible to get gyro sample rates of 32 kHz (!),
    // 8 kHz, or 1 kHz
    writeByte(_I2Caddr, CONFIG, 0x03);

