kayneyao/visionaid/arduino/STM32_MPU9250/STM32_MPU9250.cpp
    for (ii = 0; ii < 3; ii++)
    {
        // If temperature compensation bit is set, record that fact in mask_bit
        if ((accel_bias_reg[ii] & mask))
        {
            mask_bit[ii] = 0x01;
        }
    }

    // Construct total accelerometer bias, including calculated average
    // accelerometer bias from above
    // Subtract calculated averaged accelerometer bias scaled to 2048 LSB/g
    // (16 g full scale)
    accel_bias_reg[0] -= (accel_bias[0] / 8);
    accel_bias_reg[1] -= (accel_bias[1] / 8);
    accel_bias_reg[2] -= (accel_bias[2] / 8);

    data[0] = (accel_bias_reg[0] >> 8) & 0xFF;
    data[1] = (accel_bias_reg[0]) & 0xFF;
    // preserve temperature compensation bit when writing back to accelerometer
    // bias registers
    data[1] = data[1] | mask_bit[0];
    data[2] = (accel_bias_reg[1] >> 8) & 0xFF;
    data[3] = (accel_bias_reg[1]) & 0xFF;
    // Preserve temperature compensation bit when writing back to accelerometer
    // bias registers
    data[3] = data[3] | mask_bit[1];
    data[4] = (accel_bias_reg[2] >> 8) & 0xFF;
    data[5] = (accel_bias_reg[2]) & 0xFF;
    // Preserve temperature compensation bit when writing back to accelerometer
    // bias registers
    data[5] = data[5] | mask_bit[2];

    // Apparently this is not working for the acceleration biases in the MPU-9250
    // Are we handling the temperature correction bit properly?
    // Push accelerometer biases to hardware registers
    writeByte(_I2Caddr, XA_OFFSET_H, data[0]);
    writeByte(_I2Caddr, XA_OFFSET_L, data[1]);
    writeByte(_I2Caddr, YA_OFFSET_H, data[2]);
    writeByte(_I2Caddr, YA_OFFSET_L, data[3]);
    writeByte(_I2Caddr, ZA_OFFSET_H, data[4]);
    writeByte(_I2Caddr, ZA_OFFSET_L, data[5]);

    // Output scaled accelerometer biases for display in the main program
    accelBias[0] = (float)accel_bias[0] / (float)accelsensitivity;
    accelBias[1] = (float)accel_bias[1] / (float)accelsensitivity;
    accelBias[2] = (float)accel_bias[2] / (float)accelsensitivity;
}

// Accelerometer and gyroscope self test; check calibration wrt factory settings
// Should return percent deviation from factory trim values, +/- 14 or less
// deviation is a pass.
void STM32_MPU9250::MPU9250SelfTest(float *destination)
{
    uint8_t rawData[6] = {0, 0, 0, 0, 0, 0};
    uint8_t selfTest[6];
    int32_t gAvg[3] = {0}, aAvg[3] = {0}, aSTAvg[3] = {0}, gSTAvg[3] = {0};
    float factoryTrim[6];
    uint8_t FS = GFS_250DPS;

    writeByte(_I2Caddr, SMPLRT_DIV, 0x00);      // Set gyro sample rate to 1 kHz
    writeByte(_I2Caddr, CONFIG, 0x02);          // Set gyro sample rate to 1 kHz and DLPF to 92 Hz
    writeByte(_I2Caddr, GYRO_CONFIG, FS << 3);  // Set full scale range for the gyro to 250 dps
    writeByte(_I2Caddr, ACCEL_CONFIG2, 0x02);   // Set accelerometer rate to 1 kHz and bandwidth to 92 Hz
    writeByte(_I2Caddr, ACCEL_CONFIG, FS << 3); // Set full scale range for the accelerometer to 2 g

    for (int ii = 0; ii < 200; ii++)
    { // get average current values of gyro and acclerometer

        readBytes(_I2Caddr, ACCEL_XOUT_H, 6, &rawData[0]);             // Read the six raw data registers into data array
        aAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]); // Turn the MSB and LSB into a signed 16-bit value
        aAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]);
        aAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]);

        readBytes(_I2Caddr, GYRO_XOUT_H, 6, &rawData[0]);              // Read the six raw data registers sequentially into data array
        gAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]); // Turn the MSB and LSB into a signed 16-bit value
        gAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]);
        gAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]);
    }

    // Get average of 200 values and store as average current readings
    for (int ii = 0; ii < 3; ii++)
    {
        aAvg[ii] /= 200;
        gAvg[ii] /= 200;
    }

    // Configure the accelerometer for self-test
    // Enable self test on all three axes and set accelerometer range to +/- 2 g
    writeByte(_I2Caddr, ACCEL_CONFIG, 0xE0);
    // Enable self test on all three axes and set gyro range to +/- 250 degrees/s
    writeByte(_I2Caddr, GYRO_CONFIG, 0xE0);
    delay(25); // Delay a while to let the device stabilize

    // Get average self-test values of gyro and acclerometer
    for (int ii = 0; ii < 200; ii++)
    {
        // Read the six raw data registers into data array
        readBytes(_I2Caddr, ACCEL_XOUT_H, 6, &rawData[0]);
        // Turn the MSB and LSB into a signed 16-bit value
        aSTAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]);
        aSTAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]);
        aSTAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]);

        // Read the six raw data registers sequentially into data array
        readBytes(_I2Caddr, GYRO_XOUT_H, 6, &rawData[0]);
        // Turn the MSB and LSB into a signed 16-bit value
        gSTAvg[0] += (int16_t)(((int16_t)rawData[0] << 8) | rawData[1]);
        gSTAvg[1] += (int16_t)(((int16_t)rawData[2] << 8) | rawData[3]);
        gSTAvg[2] += (int16_t)(((int16_t)rawData[4] << 8) | rawData[5]);
    }

    // Get average of 200 values and store as average self-test readings
    for (int ii = 0; ii < 3; ii++)
    {
        aSTAvg[ii] /= 200;
        gSTAvg[ii] /= 200;
    }

    // Configure the gyro and accelerometer for normal operation
    writeByte(_I2Caddr, ACCEL_CONFIG, 0x00);
    writeByte(_I2Caddr, GYRO_CONFIG, 0x00);
    delay(25); // Delay a while to let the device stabilize

    // Retrieve accelerometer and gyro factory Self-Test Code from USR_Reg
    // X-axis accel self-test results
    selfTest[0] = readByte(_I2Caddr, SELF_TEST_X_ACCEL);
    // Y-axis accel self-test results
    selfTest[1] = readByte(_I2Caddr, SELF_TEST_Y_ACCEL);
    // Z-axis accel self-test results
    selfTest[2] = readByte(_I2Caddr, SELF_TEST_Z_ACCEL);
    // X-axis gyro self-test results
    selfTest[3] = readByte(_I2Caddr, SELF_TEST_X_GYRO);
    // Y-axis gyro self-test results
    selfTest[4] = readByte(_I2Caddr, SELF_TEST_Y_GYRO);
    // Z-axis gyro self-test results
    selfTest[5] = readByte(_I2Caddr, SELF_TEST_Z_GYRO);

    // Retrieve factory self-test value from self-test code reads
    // FT[Xa] factory trim calculation
    factoryTrim[0] = (float)(2620 / 1 << FS) * (pow(1.01, ((float)selfTest[0] - 1.0)));
    // FT[Ya] factory trim calculation
    factoryTrim[1] = (float)(2620 / 1 << FS) * (pow(1.01, ((float)selfTest[1] - 1.0)));
    // FT[Za] factory trim calculation
    factoryTrim[2] = (float)(2620 / 1 << FS) * (pow(1.01, ((float)selfTest[2] - 1.0)));
    // FT[Xg] factory trim calculation
    factoryTrim[3] = (float)(2620 / 1 << FS) * (pow(1.01, ((float)selfTest[3] - 1.0)));
    // FT[Yg] factory trim calculation
    factoryTrim[4] = (float)(2620 / 1 << FS) * (pow(1.01, ((float)selfTest[4] - 1.0)));
    // FT[Zg] factory trim calculation
    factoryTrim[5] = (float)(2620 / 1 << FS) * (pow(1.01, ((float)selfTest[5] - 1.0)));

    // Report results as a ratio of (STR - FT)/FT; the change from Factory Trim
    // of the Self-Test Response
    // To get percent, must multiply by 100
    for (int i = 0; i < 3; i++)
    {
        // Report percent differences
        destination[i] = 100.0 * ((float)(aSTAvg[i] - aAvg[i])) / factoryTrim[i] - 100.;
        // Report percent differences
        destination[i + 3] = 100.0 * ((float)(gSTAvg[i] - gAvg[i])) / factoryTrim[i + 3] - 100.;
    }
}

// Function which accumulates magnetometer data after device initialization.
// It calculates the bias and scale in the x, y, and z axes.
void STM32_MPU9250::magCalMPU9250(float *bias_dest, float *scale_dest)
{
    uint16_t ii = 0, sample_count = 0;
    int32_t mag_bias[3] = {0, 0, 0},
            mag_scale[3] = {0, 0, 0};
    int16_t mag_max[3] = {-32768, -32768, -32768}, // Wrote out decimal (signed) values to remove a conversion warning
        mag_min[3] = {32767, 32767, 32767},
            mag_temp[3] = {0, 0, 0};

    // Make sure resolution has been calculated
    getMres();

    Serial.println(F("Mag Calibration: Wave device in a figure 8 until done!"));
    Serial.println(
        F("  4 seconds to get ready followed by 15 seconds of sampling)"));
    delay(4000);

    // shoot for ~fifteen seconds of mag data
    // at 8 Hz ODR, new mag data is available every 125 ms
    if (Mmode == M_8HZ)
    {
        sample_count = 128;
    }
    // at 100 Hz ODR, new mag data is available every 10 ms
    if (Mmode == M_100HZ)
    {
        sample_count = 1500;
    }

    for (ii = 0; ii < sample_count; ii++)
    {
        readMagData(mag_temp); // Read the mag data

        for (int jj = 0; jj < 3; jj++)
        {
            if (mag_temp[jj] > mag_max[jj])
            {
                mag_max[jj] = mag_temp[jj];
            }
            if (mag_temp[jj] < mag_min[jj])
            {
                mag_min[jj] = mag_temp[jj];
            }
        }

        if (Mmode == M_8HZ)
        {
            delay(135); // At 8 Hz ODR, new mag data is available every 125 ms
        }
        if (Mmode == M_100HZ)
        {
            delay(12); // At 100 Hz ODR, new mag data is available every 10 ms
        }
    }

    // Serial.println("mag x min/max:"); Serial.println(mag_max[0]); Serial.println(mag_min[0]);
    // Serial.println("mag y min/max:"); Serial.println(mag_max[1]); Serial.println(mag_min[1]);
    // Serial.println("mag z min/max:"); Serial.println(mag_max[2]); Serial.println(mag_min[2]);

    // Get hard iron correction
    // Get 'average' x mag bias in counts
    mag_bias[0] = (mag_max[0] + mag_min[0]) / 2;
    // Get 'average' y mag bias in counts
    mag_bias[1] = (mag_max[1] + mag_min[1]) / 2;
    // Get 'average' z mag bias in counts
    mag_bias[2] = (mag_max[2] + mag_min[2]) / 2;

    // Save mag biases in G for main program
    bias_dest[0] = (float)mag_bias[0] * mRes * factoryMagCalibration[0];
    bias_dest[1] = (float)mag_bias[1] * mRes * factoryMagCalibration[1];
    bias_dest[2] = (float)mag_bias[2] * mRes * factoryMagCalibration[2];

    // Get soft iron correction estimate
    // Get average x axis max chord length in counts
    mag_scale[0] = (mag_max[0] - mag_min[0]) / 2;
    // Get average y axis max chord length in counts
    mag_scale[1] = (mag_max[1] - mag_min[1]) / 2;
    // Get average z axis max chord length in counts
    mag_scale[2] = (mag_max[2] - mag_min[2]) / 2;

    float avg_rad = mag_scale[0] + mag_scale[1] + mag_scale[2];
    avg_rad /= 3.0;

    scale_dest[0] = avg_rad / ((float)mag_scale[0]);
    scale_dest[1] = avg_rad / ((float)mag_scale[1]);
    scale_dest[2] = avg_rad / ((float)mag_scale[2]);

