kayneyao/visionaid/arduino/STM32_MPU9250/STM32_MPU9250.cpp
    Serial.println(F("Mag Calibration done!"));
}

// Wire.h read and write protocols
uint8_t STM32_MPU9250::writeByte(uint8_t deviceAddress, uint8_t registerAddress,
                                 uint8_t data)
{
    return writeByteWire(deviceAddress, registerAddress, data);
}

uint8_t STM32_MPU9250::writeByteWire(uint8_t deviceAddress, uint8_t registerAddress,
                                     uint8_t data)
{
    _wire->setClock(_interfaceSpeed);        // Reset to the desired speed, in case other devices required a slowdown
    _wire->beginTransmission(deviceAddress); // Initialize the Tx buffer
    _wire->write(registerAddress);           // Put slave register address in Tx buffer
    _wire->write(data);                      // Put data in Tx buffer
    _wire->endTransmission();                // Send the Tx buffer
    // TODO: Fix this to return something meaningful
    // return NULL; // In the meantime fix it to return the right type
    return 0;
}

// Read a byte from given register on device. Calls necessary SPI or I2C
// implementation. This was configured in the constructor.
uint8_t STM32_MPU9250::readByte(uint8_t deviceAddress, uint8_t registerAddress)
{
    return readByteWire(deviceAddress, registerAddress);
}

// Read a byte from the given register address from device using I2C
uint8_t STM32_MPU9250::readByteWire(uint8_t deviceAddress, uint8_t registerAddress)
{
    uint8_t data; // `data` will store the register data

    // Initialize the Tx buffer
    _wire->beginTransmission(deviceAddress);
    // Put slave register address in Tx buffer
    _wire->write(registerAddress);
    // Send the Tx buffer, but send a restart to keep connection alive
    _wire->endTransmission(false);
    // Read one byte from slave register address
    _wire->requestFrom(deviceAddress, (uint8_t)1);
    // Fill Rx buffer with result
    data = _wire->read();
    // Return data read from slave register
    return data;
}

// Read 1 or more bytes from given register and device using I2C
uint8_t STM32_MPU9250::readBytesWire(uint8_t deviceAddress, uint8_t registerAddress,
                                     uint8_t count, uint8_t *dest)
{
    // Initialize the Tx buffer
    _wire->beginTransmission(deviceAddress);
    // Put slave register address in Tx buffer
    _wire->write(registerAddress);
    // Send the Tx buffer, but send a restart to keep connection alive
    _wire->endTransmission(false);

    uint8_t i = 0;
    // Read bytes from slave register address
    _wire->requestFrom(deviceAddress, count);
    while (_wire->available())
    {
        // Put read results in the Rx buffer
        dest[i++] = _wire->read();
    }

    return i; // Return number of bytes written
}

uint8_t STM32_MPU9250::readBytes(uint8_t deviceAddress, uint8_t registerAddress,
                                 uint8_t count, uint8_t *dest)
{
    if (_csPin == NOT_SPI) // Read via I2C
    {
        return readBytesWire(deviceAddress, registerAddress, count, dest);
    }
    else // Read using SPI
    {
        return readBytesSPI(registerAddress, count, dest);
    }
}

bool STM32_MPU9250::magInit()
{
    // Reset registers to defaults, bit auto clears
    writeByteSPI(0x6B, 0x80);
    // Auto select the best available clock source
    writeByteSPI(0x6B, 0x01);
    // Enable X,Y, & Z axes of accel and gyro
    writeByteSPI(0x6C, 0x00);
    // Config disable FSYNC pin, set gyro/temp bandwidth to 184/188 Hz
    writeByteSPI(0x1A, 0x01);
    // Self tests off, gyro set to +/-2000 dps FS
    writeByteSPI(0x1B, 0x18);
    // Self test off, accel set to +/- 8g FS
    writeByteSPI(0x1C, 0x08);
    // Bypass DLPF and set accel bandwidth to 184 Hz
    writeByteSPI(0x1D, 0x09);
    // Configure INT pin (active high / push-pull / latch until read)
    writeByteSPI(0x37, 0x30);
    // Enable I2C master mode
    // TODO Why not do this 11-100 ms after power up?
    writeByteSPI(0x6A, 0x20);
    // Disable multi-master and set I2C master clock to 400 kHz
    // https://developer.mbed.org/users/kylongmu/code/MPU9250_SPI/ calls says
    // enabled multi-master... TODO Find out why
    writeByteSPI(0x24, 0x0D);
    // Set to write to slave address 0x0C
    writeByteSPI(0x25, 0x0C);
    // Point save 0 register at AK8963's control 2 (soft reset) register
    writeByteSPI(0x26, 0x0B);
    // Send 0x01 to AK8963 via slave 0 to trigger a soft restart
    writeByteSPI(0x63, 0x01);
    // Enable simple 1-byte I2C reads from slave 0
    writeByteSPI(0x27, 0x81);
    // Point save 0 register at AK8963's control 1 (mode) register
    writeByteSPI(0x26, 0x0A);
    // 16-bit continuous measurement mode 1
    writeByteSPI(0x63, 0x12);
    // Enable simple 1-byte I2C reads from slave 0
    writeByteSPI(0x27, 0x81);

#ifdef SERIAL_DEBUG
    Serial.print("MPU9250::magInit to return ");
    Serial.println((ret == 0x48) ? "true" : "false");
#endif
    return ret == 0x48;
}

// Write a null byte w/o CS assertion to get SPI hardware to idle high (mode 3)
void STM32_MPU9250::kickHardware()
{
    _spi->beginTransaction(SPISettings(SPI_DATA_RATE, MSBFIRST, SPI_MODE));
    _spi->transfer(0x00); // Send null byte
    _spi->endTransaction();
}

bool STM32_MPU9250::begin()
{
    kickHardware();
    return magInit();
}
